<link href="../style1.css" rel="stylesheet" type="text/css">
<p class="Contenu_Titre2">Les Metiers Du Jeu Video :</p>
<p><span class="Contenu_Texte">Voci un tutorial qui tente de regrouper  toutes les information sur ce sujet. Sachez que ce tuto n'est pas de moi je l'ai trouver sur le net vous trouverez l'adresse de cette article en ala fin de ce cours. </span></p>
<p class="Contenu_Titre3">Les Metiers -Partie1- Le Studio De Developpement : </p>
<p align="left" class="Contenu_Texte">Le   studio de d&eacute;veloppement est l'endroit ou le jeu est invent&eacute; et r&eacute;alis&eacute;. On peut   d&eacute;couper les m&eacute;tiers en 3 cat&eacute;gories :</p>
<p align="left" class="Contenu_Texte">-   Le management : Manager, Commercial, Directeur Artistique, Directeur Technique,   Chef de projet</p>
<p align="left" class="Contenu_Texte">-   La partie cr&eacute;ative : Game Designer, Level Designer.</p>
<p align="left" class="Contenu_Texte">-   La technique : Programmeur, Infographiste, Testeur, Sound Designer,   Musicien.</p>
<p align="left" class="Contenu_Texte"><strong>Manager:</strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte" align="left">Son Boulot: </strong>G&eacute;rer la boite. Il peut &ecirc;tre assist&eacute; d'une secr&eacute;taire pour l'aspect   administratif. </li>
</ul>
<p align="left" class="Contenu_Texte"><strong>Comercial:</strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte" align="left">Son boulot</strong> : D&eacute;crocher des contrats. Contacter les &eacute;diteurs,   pr&eacute;senter les futurs projets, n&eacute;gocier les prix.</li>
</ul>
<p class="Contenu_Texte"><strong>Directeur Creatif </strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte">Son boulot </strong>: Beaucoup de gens pensent que le game   designer est le grand manitou sur une production de jeux vid&eacute;o. Pourtant ce   n'est pas le cas. Ainsi il existe une personne au dessus du lead designer, le   directeur cr&eacute;atif.<BR>
  Il a un peu un r&ocirc;le de r&eacute;alisateur sur la production en   supervisant le design, la coh&eacute;rence artistique, l'avanc&eacute;e globale du   projet.<BR>
  Pour r&eacute;sumer son travail, on peut dire que le directeur cr&eacute;atif   travaillera au sein de la direction cr&eacute;ative afin de d&eacute;velopper la vision   globale du jeu en ce qui concerne les &eacute;l&eacute;ments d&rsquo;interactivit&eacute;, de spectacle et   de marketing.<BR>
  Le directeur cr&eacute;atif est donc l'interlocuteur privil&eacute;gi&eacute; de   l'&eacute;quipe de production et de l'&eacute;quipe &eacute;ditoriale.<BR>
  </li>
  <li class="Contenu_Texte"><strong>L&rsquo;&eacute;volution</strong> : Il   y a peu d&rsquo;&eacute;volution pour le directeur cr&eacute;atif&hellip; Etant &agrave; la t&ecirc;te du comit&eacute;   cr&eacute;atif, ses &eacute;volutions seraient plus des reconversions dans des m&eacute;tiers plus   g&eacute;n&eacute;ralistes comme chef de projet, producteur.<BR>
  </li>
  <li class="Contenu_Texte"><strong>Comment devenir   directeur cr&eacute;atif</strong> : Il n'y a pas de formation pour devenir directement   directeur cr&eacute;atif. Le directeur cr&eacute;atif est une personne ayant fait ses preuves   dans le game design en ayant travaill&eacute; sur de nombreux AAA (jeux &agrave; succ&egrave;s et &agrave;   gros budget), de pr&eacute;f&eacute;rence comme lead designer. Il doit donc avoir une   expertise en game design, &ecirc;tre tr&egrave;s cr&eacute;atif, savoir diriger une &eacute;quipe,   comprendre les probl&eacute;matiques Marketing, savoir &eacute;couter et avoir de bonnes   comp&eacute;tences artistiques.</li>
</ul>
<p class="Contenu_Texte"><strong>Directeur Artistique </strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot</strong> : Donner une direction artistique sur les jeux.   Harmoniser les m&eacute;thodes et les r&eacute;sultats. Le directeur artistique s'occupe des   &eacute;quipes graphistes. Il peut &ecirc;tre &eacute;galement lead artist dans les petites   structures.</li>
</ul>
<p class="Contenu_Texte"><strong>Directeur Technique </strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte">Son boulot</strong> : Il s'occupe de tous les points techniques   de la soci&eacute;t&eacute;s. C'est lui qui d&eacute;cide et mets en place les technique qui seront   utilis&eacute;s sur les jeux.</li>
</ul>
<p class="Contenu_Texte"><strong>Chef De Projet </strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot</strong> : Il s'occupe de g&eacute;rer la bonne marche d'un projet.   Le chef de projet doit &eacute;tablir les planning et veuillez a ce qu'ils soient   tenus. C'est lui qui fait l'intermediaire entre l'&eacute;quipe et le   client.</li>
</ul>
<p class="Contenu_Texte"><strong>Game Designer </strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte" align="left">Son boulot : </strong>Le game designer est charg&eacute; de la conception   th&eacute;orique du jeu. A partir d&rsquo;une id&eacute;e originale ou de demandes marketing (high   concept), il imagine un jeu et le retranscrit sur papier: style du jeu,   histoire, gameplay&hellip;<BR>
  Le game designer est rarement seul sur un projet. Ainsi,   les projets de taille correcte sont compos&eacute;s d&rsquo;une &eacute;quipe de game designers   imaginant le jeu ensemble durant les s&eacute;ances de brainstorming (s&eacute;ances o&ugrave; les   game designers &eacute;changent toutes leurs id&eacute;es entre eux).<BR>
  Les game designers   sont en charge de l&rsquo;&eacute;criture du game design document. On peut r&eacute;sumer ce travail   de la sorte : chaque game designer s&rsquo;occupe de r&eacute;diger une partie du document et   le lead&nbsp; designer s&rsquo;occupe de v&eacute;rifier la coh&eacute;rence du document.<BR>
  Durant la   production, les game designers v&eacute;rifieront que le game design document est bien&nbsp;   respect&eacute; en testant et retestant le level design, en r&eacute;glant le gameplay,   etc.<BR>
  </li>
  <li class="Contenu_Texte">    <strong>L&rsquo;&eacute;volution :</strong> En terme d&rsquo;&eacute;volution, le game designer pourra   passer lead game designer puis creative director.<BR>
  </li>
  <li class="Contenu_Texte"><strong>Comment devenir   Concepteur de jeu :</strong> Les formations correspondent aux m&ecirc;mes formations que   pour devenir level designer.</li>
  <li class="Contenu_Texte"><strong class="Contenu_Texte" align="left">Salaire</strong> : 27167 Eur Brut/an en moyenne (2003).</li>
</ul>
<p class="Contenu_Texte"><strong>Level Designer/Level Builder </strong></p>
<ul>
  <li><span class="Contenu_Texte"><strong class="Contenu_Texte">Son boulot&nbsp;</strong>: Le level designer est charg&eacute; de la cr&eacute;ation   des niveaux du jeu. Pour cela, il doit prendre en compte tous les &eacute;l&eacute;ments   contenus dans le game design afin de bien r&eacute;gler le rythme du jeu, la   difficult&eacute;, la diversit&eacute;&hellip; Les phases de tests sont donc tr&egrave;s importantes pour   &eacute;viter toutes sortes de probl&egrave;mes&nbsp;: cam&eacute;ras g&ecirc;nantes, difficult&eacute; trop importante   &agrave; certains endroits, etc. Le level designer collabore donc souvent avec les   graphistes et les programmeurs. <BR>
    </span></li>
  <li><span class="Contenu_Texte"><strong>Diff&eacute;rence level design / level   build</strong>&nbsp;:<BR>
    Le level design est la phase &ldquo;th&eacute;orique&rdquo; : on dessine sur papier   le niveau en imaginant ce que &ccedil;a donnerait dans le jeu, si tous les &eacute;l&eacute;ments du   game design sont pr&eacute;sents dans le niveau...<BR>
    Le level build correspond &agrave; la   partie &laquo;&nbsp;pratique&nbsp;&raquo;&nbsp;: on cr&eacute;e le niveau gr&acirc;ce &agrave; un &eacute;diteur (Unreal ED, 3d max,   &hellip;) et on l&rsquo;int&egrave;gre dans le jeu pour le tester. Le level builder pourra &eacute;galement   assurer le r&ocirc;le de codeur sc&eacute;narique (coder les scripts &agrave; l&rsquo;int&eacute;rieur d&rsquo;un   niveau).<BR>
    </span></li>
  <li><span class="Contenu_Texte"><strong>L&rsquo;&eacute;volution&nbsp;:</strong><BR>
    En terme d&rsquo;&eacute;volution, le level designer   pourra passer lead level designer, migrer vers le m&eacute;tier de game designer et   atteindre par la suite le m&eacute;tier de cr&eacute;ative director.<BR>
    </span></li>
  <li><span class="Contenu_Texte"><strong>Comment devenir   Concepteur de niveau&nbsp;:</strong><BR>
    Plusieurs voix sont possibles pour devenir level   designer.<BR>
    - <U>formation autodidacte</U>&nbsp;: on se forme soi m&ecirc;me en cr&eacute;ant des   niveaux pour des jeux amateurs ou des mods. Le mieux est d&rsquo;apprendre &agrave; se servir   d&rsquo;un maximum d&rsquo;outils, que ce soit des &eacute;diteurs de niveaux comme Unreal ED ou   des logiciels de mod&eacute;lisation 3D comme Maya ou 3d Max. Ceci vous aidera &agrave;   apprendre rapidement &agrave; utiliser de nouveaux outils par la suite (comme des   &eacute;diteurs de niveau interne au studio de d&eacute;veloppement).<BR>
    - <U>formation   informatique</U>&nbsp;: La formation la plus pratique pour ce m&eacute;tier est le DUT   informatique car il permet d&rsquo;obtenir de bonnes bases en informatique sans &ecirc;tre   oblig&eacute;s de faire 5 ann&eacute;es qui ne &laquo;&nbsp;serviraient&nbsp;&raquo; pas pour ce m&eacute;tier. Le DUT vous   apprendra le C/C++/java qui vous seront utiles pour le codage sc&eacute;narique. Bien   sur, plus vous &eacute;tudes seront pouss&eacute;es en informatique (dess, dea, &eacute;cole   d&rsquo;ing&eacute;nieur), plus vous assurerez votre avenir.&nbsp;J<BR>
    -<U> formation   artistique</U>&nbsp;: De bonnes bases en infographie ou/et en architecture sont   &eacute;galement de tr&egrave;s bonnes bases pour ce m&eacute;tier. En effet, on retrouve dans de   nombreuses grosses productions des architectes qui s&rsquo;occupent du level   design.<BR>
  - <U>Formation au jeu vid&eacute;o</U>&nbsp;: plusieurs &eacute;coles offrent des   formations pour le jeu vid&eacute;o. Je vous les d&eacute;conseille&hellip; Non pas que leurs   formations soient toutes mauvaises mais il faut regarder vers le futur&hellip;   Imaginons que vous en ayez assez du jeu vid&eacute;o par la suite, que vous soyez mal   pay&eacute;s et que vous souhaitiez travailler dans une autre industrie, que le jeu   vid&eacute;o dispara&icirc;t&hellip; que ferez vous avec un dipl&ocirc;me de jeu vid&eacute;o&nbsp;?!</span><BR>
  </li>
</ul>
<p class="Contenu_Texte"><strong>Programmeur</strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot :</strong> Les jeux sont principalement programm&eacute;es en C++.   Le programmeurs a pour tache de r&eacute;aliser le jeu en respectant ce qui est d&eacute;crit   dans le document de game design ainsi que les contraintes impos&eacute;es dans le   technical design. Les jeux &eacute;tant tr&eacute;s consequents en nombre de lignes, chaque   programmeur a une specialit&eacute; : 3d, IA, GamePlay, Cr&eacute;ation des outils, Son, Bas   Niveau, Sp&eacute;cialiste sur une plateforme (PS2, XBOX, NGC, ...), Interfaces et   menus, Effets Speciaux, Recherche et Developpement.</li>
  <li class="Contenu_Texte"><strong align="left">Outils utilis&eacute;s : </strong>Le programmeur travaille principalement sur   PC (y compris pour les jeux consoles). Lorsque la plateforme n'est pas le PC, il   execute son code sur un kit de d&eacute;veloppement, une sorte de grosse console   offrant des capacit&eacute; de debugage. Le compilateur le plus utilis&eacute; est <U>Visual   C++</U>. Sur certaines plateformes <U>CodeWarrior</U> est utilis&eacute;&nbsp;   (Playstation2, Gamecube). Pour les programmeurs proches des graphistes (3D, Menus, Effet   Speciaux) il est recommand&eacute; se savoir se servir des outils de graphistes, pour   etre plus autonome et pouvoir generer soit meme ses donnees de tests ou les   modifier rapidement.</li>
  <li class="Contenu_Texte"><strong align="left">L&rsquo;&eacute;volution&nbsp;: </strong>Un programmeur peut devenir plus g&eacute;n&eacute;raliste ou   changer de sp&eacute;cialit&eacute;. Les programmeurs plus experiment&eacute; peuvent devenir chef   d'&eacute;quipe ou Lead programmer. Ce nouveau m&eacute;tier comprends la gestion de l'&eacute;quipe,   des plannings. Un programmeur peut &eacute;galement devenir game designer.</li>
  <li class="Contenu_Texte"><strong align="left">Comment devenir programmeur&nbsp;: </strong>Les formations pour devenir   programmeurs sont tr&egrave;s nombreuses. En effet, le m&eacute;tier de programmeur peut   s'appliquer dans tous les secteurs. Voir section formations.</li>
  <li class="Contenu_Texte"><strong align="left">Comment devenir programmeur&nbsp;dans le jeu video : </strong>Pour devenir   programmeur dans le jeu vid&eacute;o il faut une formation de programmeur, ainsi qu'un   exp&eacute;rience de jeux vid&eacute;o. Pour cela il est possible de r&eacute;aliser des petits   projets personnels, ou de suivre une formation sp&eacute;cifique (voir chapitre   formations). Un bonne culture vid&eacute;o ludique est aussi apr&eacute;&ccedil;iable. </li>
  <li class="Contenu_Texte"><strong align="left">Salaire</strong> : 31129 Eur Brut/an en moyenne (2003).</li>
</ul>
<p class="Contenu_Texte"><strong>Infographiste (2D,3D,Animateur) </strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot</strong> : Les infographistes ont pour mission de   retranscrire sur ordinateurs les volont&eacute;s de l'&eacute;quipe cr&eacute;ative. </li>
  <li class="Contenu_Texte"><strong align="left">Salaire</strong> : 24300 Eur Brut/an en moyenne (2003). </li>
</ul>
<p class="Contenu_Texte"><strong>Testeur</strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot : </strong>Un testeur teste(sans blague :p), c'est &agrave; dire qu'il passe ses   journ&eacute;es &agrave; refaire dix fois, cent fois, le m&ecirc;me passage d'un jeu pour bien   cerner un probl&egrave;me qu'il aura rep&eacute;r&eacute;. Ensuite il va entrer toutes les   informations indigestes dans une grosse base de donn&eacute;e afin que l'&eacute;quipe   comprenne bien o&ugrave; est le probl&egrave;me. Puis, une semaine ou deux plus tard, il va   refaire dix ou cent fois la m&ecirc;me chose pour v&eacute;rifier la correction. Et tout ca   sur le m&ecirc;me jeu, pendant des semaines et des mois. <BR>
  Les carri&egrave;res   envisageable du testeur sont soit lead testeur, ce qui revient &agrave; g&eacute;rer une   &eacute;quipe et &agrave; reporter au chef de projet / producer l'&eacute;volution de la base de   bugs, soit game designer, s'il a de la chance et le talent.</li>
  <li class="Contenu_Texte"><strong align="left">Salaire</strong> : 17200 Eur Brut/an en moyenne (2003). </li>
</ul>
<p class="Contenu_Texte"><strong>Sound Deisigner</strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot</strong> : Cr&eacute;e les sons qui seront utilis&eacute;s dans le   jeu.</li>
</ul>
<p class="Contenu_Texte"><strong>Musicien</strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot</strong> : Composer et enregistrer la musique du jeu. </li>
</ul>
<p><span class="Contenu_Titre3">Les Metiers -Partie2- Les Editeurs : </span></p>
<p><strong class="Contenu_Texte" align="left">Producer</strong></p>
<ul class="Contenu_Texte">
  <li><strong class="Contenu_Texte" align="left">Son boulot</strong> : Il s'occupe du suivi du projet. C'est lui   l'interm&eacute;diaire entre le studio de d&eacute;veloppement et l'&eacute;diteur. </li>
  <li><strong class="Contenu_Texte" align="left">Salaire</strong> : 39441 Eur Brut/an en moyenne (2003). </li>
</ul>
<p class="Contenu_Texte"><strong>Marketing</strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="center">Son boulot</strong> : Planifier, cr&eacute;er et mettre en place les &eacute;l&eacute;ments   marketing (pub, etc) du jeu. </li>
</ul>
<p class="Contenu_Texte"><strong>Loaclisation</strong></p>
<ul>
  <li class="Contenu_Texte"><strong align="left">Son boulot</strong> : S'occupe de la traduction du jeu en differentes   langues. </li>
</ul>
<p class="Contenu_Texte"><strong>Ventes</strong></p>
<ul>
  <li class="Contenu_Texte">A Faire </li>
</ul>
<p><span class="Contenu_Titre3">Les Metiers -Partie3- Magasins et Magazines : </span></p>
<p class="Contenu_Texte"><strong>Vendeur</strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte">Son boulot</strong> : Conseiller le client et vendre les jeux et   produits.</li>
</ul>
<p class="Contenu_Texte"><strong>Redacteur</strong></p>
<ul>
  <li class="Contenu_Texte"><strong class="Contenu_Texte">Son boulot</strong> : Analyser les jeux et r&eacute;diger des tests ou   articles. </li>
</ul>
<p class="Contenu_Texte">Voila je crois qu'ont a fait le tour vous pourrez retrouver l'integralit&eacute; de cette article a l'adresse suivante:</p>
<p class="Contenu_Texte"><a href="http://perso.numericable.fr/~ckckck/MetiersJeuxVideos.htm">http://perso.numericable.fr/~ckckck/MetiersJeuxVideos.htm</a></p>
<p class="Bas_Remarque">Yami </p>
