<link href="../style1.css" rel="stylesheet" type="text/css" />

<p align="left" class="Contenu_Titre1">Divers - Conseils genereaux pour RPG  </p>
<p align="left" class="Contenu_Texte">Cette page regroupe des conseils d'ordre general qui sont valables pour tous les RPG. </p>
<h1 class="Contenu_Titre2">Combats :</h1>
<p><strong class="Contenu_Titre3">Quand vous &eacute;t&eacute;s dans un combat au tour par tour&nbsp;:</strong> <span class="Contenu_Texte">quand vous disputez un combat de ce type, le mieux est de bien r&eacute;fl&eacute;chir au type d&rsquo;ennemie de d&rsquo;utiliser les attaques au quel il est faible. Quand vous avez plusieurs ennemies contre vous l&rsquo;id&eacute;ale est d&rsquo;attaquer le m&ecirc;me ennemi jusqu&rsquo;a ce qu&rsquo;il meurt ainsi vous diminuez le nombre d&rsquo;ennemie pouvant vous attaquer, aussi n&rsquo;h&eacute;sitez pas a utiliser les objets.</span></p>
<p><strong class="Contenu_Titre3">Quand vous combattez en temps r&eacute;elle&nbsp;: </strong><span class="Contenu_Texte">le combat en temps r&eacute;elle demande beaucoup de r&eacute;flexes. Vous devrez bien observer les mouvements de votre adversaire et utiliser l&rsquo;environnement au tour de vous a votre avantage. Attendez toujours le bon moment pour attaquer et ne foncez jamais t&ecirc;te baisser sur l&rsquo;adversaire, sachez utiliser aussi la d&eacute;fense, et non que l&rsquo;attaque. Quand l&rsquo;occasion se pr&eacute;sente frappez autant de coups que vous le pouvez. </span></p>
<p class="contenu"><strong class="Contenu_Titre3">Quand vous combattez un boss&nbsp;: </strong><span class="Contenu_Texte">une bonne astuce pour venir a bout des boss est d&rsquo;utiliser les techniques et objets qui empoisonne, paralyse ou encore endorme et utiliser les attaques dont il est vuln&eacute;rable. Aussi abusez toujours des objets qui vous soignent. Voila pour les boss.</span></p>
<p><span class="sous_titre"><strong class="Contenu_Titre3">Savoir utiliser les objets&nbsp;:</strong> </span><span class="Contenu_Texte">vous devez savoir utiliser les objet que vous avez au cours de combat. Ex&nbsp;: utilisez un objet qui recharge les PV au Max que quand vous en avez presque plus. </span></p>
<p class="Contenu_Titre2"><strong>Au cours de l&rsquo;aventure&nbsp;: </strong></p>
<p><span class="Contenu_Titre3"><strong class="sous_titre">Am&eacute;liorez vos connaissances&nbsp;</strong></span><strong class="sous_titre">:</strong> <span class="Contenu_Texte">n&rsquo;h&eacute;sitez pas a parler a tous le monde afin d&rsquo;apprendre plus sur votre RPG ces actions son gratuites et utiles. Abusez en.</span></p>
<p><strong class="Contenu_Titre3">Avant de partir a l&rsquo;aventure&nbsp;: </strong><span class="Contenu_Texte">assurez vous de toujours poss&eacute;der les objets de soins avant d&rsquo;aller a l&rsquo;aventure car ses objets seront d&rsquo;une grande utilit&eacute; au cours de votre aventure.</span></p>
<p><span class="Contenu_Titre3"><strong>Quand vous &eacute;t&eacute;s dans une ville&nbsp;:</strong><strong></strong></span> <span class="Contenu_Texte">des que vous arrivez dans une ville la 1er chose a faire est de sauvegarder votre partie, car la ville est un endroit sur et sans ennemis (sauf exception). Allez toujours vous regenerer dans les auberges et faites toujours le plains d&rsquo;objets en les achetant dans les diff&eacute;rents magasins.</span></p>
<p><span class="Contenu_Titre3"><strong>Actualisez vos armes&nbsp;:</strong></span> <span class="Contenu_Texte">plus vous progressez dans le jeu plus les ennemies sont puissants alors n&rsquo;h&eacute;sitez pas a vous d&eacute;barrassez de vos anciennes armes pour en avoir de plus puissantes.</span></p>
<p><strong class="Contenu_Titre3">Ne soyez pas radins&nbsp;: </strong><span class="Contenu_Texte">n&rsquo;h&eacute;sitez pas a d&eacute;penser votre argent dans des objets et armes utiles et puissantes. Sans bien sur devenir une b&ecirc;te du shoping.</span></p>
<p><span class="Contenu_Titre3"><strong>Sachez tirer profit de vos objets inutiles&nbsp;:</strong></span><span class="Contenu_Texte"> Quand vous avez des objets que vous n&rsquo;utilisez plus ou que ces sont pr&eacute;cieux comme les rubis les diamants, vendez les au lieux de les jeter, ainsi vous r&eacute;colterez de l&rsquo;argents pour des armes ect.</span></p>
<p><strong class="Contenu_Titre3">Profiter de plusieurs sauvegardes&nbsp;: </strong><span class="Contenu_Texte">ne soyez pas stupide d&rsquo;utiliser 1 seule sauvegarde quand vous pouvez en utiliser plusieurs. Ex&nbsp;: quand vous entrer dans un donjon sauvegardez a son entrez au beau milieu puis devant le boss.</span></p>
<p class="Bas_Remarque">Voila en esperant vous avoir aid&eacute; su vous avez d'autres conseils utiles n'hesitez pas me les envoyer.</p>
<p class="Bas_Remarque">Lundi-31-07-2006 par Yami </p>
