
<p class="Contenu_Titre1">Installation et decouverte :</p>
<p><span class="Contenu_Titre3"><strong>Pr&eacute;sentation </strong>:&nbsp;</span><span class="Contenu_Texte"> RPG Maker Xp est un Moteur/logiciel cr&eacute;&eacute; par la soci&eacute;t&eacute; ASCII. Gr&acirc;ce a ce   logiciel vous pourrez faire vos propres jeux de r&ocirc;les tr&egrave;s facilement en cr&eacute;ant   des cartes en configurant vos personnages par exemple. RPG Maker est un logiciel   payant qui se vend uniquement au Japon, en Cor&eacute;e Du Sud et en Chine et il est   &eacute;crit uniquement dans les langues de ces 3 pays et une version en anglais   officiel est sortie depuis 2005. Les versions en fran&ccedil;ais et en autres langues   latines que vous pourrez trouver sur Internet notamment sur ce site sont des   logiciels pirat&eacute;s et ill&eacute;gaux&nbsp; et ceci   est mal tol&egrave;r&eacute; par la soci&eacute;t&eacute; cr&eacute;atrice. Mais bon nous, on s&rsquo;en tape dans le   fond ,du moment qu&rsquo;ont peut faire nos RPG, hein et puis si la soci&eacute;t&eacute; l&rsquo;avait   fait en fran&ccedil;ais ou gratuit nous n&rsquo;en serions pas a ce   stade&hellip;</span></p>
<p class="Contenu_Titre2">T&eacute;l&eacute;chargement et   installation&nbsp;:</p>
<p class="Contenu_Titre3">T&eacute;l&eacute;charger&nbsp;:</p>
<p class="Contenu_Texte">Notez que vous   aurez besoin de deux fichiers indispensables qui sont&nbsp;:</p>
<ul>
  <li class="Contenu_Texte">Le logiciel RPG Maker   XP</li>
  <li><span class="Contenu_Texte">Le RTP de RPG Maker Xp ou RGSS</span>   [allez voir le lexique].</li>
</ul>
<p><a href="rpgxp.php?url=down">Allez a la page de   t&eacute;l&eacute;chargements </a></p>
<p class="Contenu_Titre3">Installer&nbsp;:</p>
<p class="Contenu_Texte">Tout d&rsquo;abord dezziper le   contenu des 2 archives ensuite ex&eacute;cutez les 2 fichiers extrait tour a tour et   faites pour chacun l&rsquo;op&eacute;ration tr&egrave;s simple d&rsquo;appuyer sur &laquo;&nbsp;suivant&nbsp;&raquo; dans la   fen&ecirc;tre d&rsquo;installation.</p>
<p class="Contenu_Titre2">Cr&eacute;er un nouveau projet sur RPG   Maker Xp&nbsp;:</p>
<p class="Contenu_Texte">Lancez RPG Maker Xp puis dans   la fen&ecirc;tre qui s&rsquo;affiche (dont la plupart des boutons sont inutilisables pour   l&rsquo;instant.) faites&nbsp;: &laquo;&nbsp;Fichier-&gt;&nbsp;   Cr&eacute;er un nouveau projet&nbsp;&raquo; ou utilisez le raccourcis clavier CRTL+N. La   boite de dialogue suivante s&rsquo;affiche&nbsp;:</p>
<p align="center" class="Contenu_Texte"><img src="Tuto_Images/debut_pres1.jpg" width="522" height="248" /></p>
<p class="Contenu_Texte"><span class="Contenu_Titre3">Nom du dossier:</span> vous devez d&eacute;terminer le nom du dossier ou seront stock&eacute;s   les fichiers de votre jeu. Il peut &ecirc;tre le m&ecirc;me que celui de votre jeu ou celui   de votre groupe.<br />
  <span class="Contenu_Titre3">Titre du projet<strong>:</strong></span><strong> </strong>vous devez ici donner le nom de   votre jeu. En g&eacute;n&eacute;ral le m&ecirc;me nom que le dossier&nbsp; lui est attribu&eacute;   automatiquement.<br />
<span class="Contenu_Titre3">R&eacute;pertoire du dossier:</span>c'est l'endroit ou sera stock&eacute; le   dossier du projet dans votre ordinateur. Un chemin est automatiquement attribu&eacute;   que je vous recommande de ne pas changer. Si toutefois vous voulez le changer   cliquez sur le bouton <img src="Tuto_Images/debut_pres2.gif" width="31" height="23" />.</p>
<p class="Contenu_Titre2">La fen&ecirc;tre principale de RPG Maker   XP&nbsp;:</p>
<p align="center" class="Contenu_Titre2"><img src="Tuto_Images/debut_pres3.gif" width="603" height="452" /></p>
<p class="Contenu_Titre3">1-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   La barre d&rsquo;outils&nbsp;: Elle contient   les &eacute;l&eacute;ments suivants&nbsp;:</p>
<p><img src="Tuto_Images/debut_pres4.gif" width="120" height="35" /><span class="Contenu_Texte"> Comme dans tous les logiciels, dans l&rsquo;ordre&nbsp;: Nouveau projet &ndash; ouvrir un projet-   Enregistrer votre projet.</span></p>
<p><img src="Tuto_Images/debut_pres6.gif" width="34" height="30" /><img src="Tuto_Images/debut_pres5.gif" width="85" height="32" /><span class="Contenu_Texte"> Dans l&rsquo;ordre&nbsp;:Retourner en arri&egrave;re - Couper &ndash;Copier &ndash; Coller &ndash; Effacer.</span></p>
<p><img src="Tuto_Images/debut_pres7.gif" width="118" height="35" /> <span class="Contenu_Texte">Les couches (serons plus expliqu&eacute;s plus tard)&nbsp;: dans l&rsquo;ordre&nbsp;: couche basse &ndash;   couche moyenne &ndash; couche haute &ndash; couche d&rsquo;&eacute;v&eacute;nements</span>.</p>
<p><img src="Tuto_Images/debut_pres8.gif" width="118" height="35" /> <span class="Contenu_Texte">Outils de dessin&nbsp;:  dessiner normalement- dessiner avec des carr&eacute;s &ndash;   dessiner avec des cercles &ndash; remplir un zone &ndash; rectangle de s&eacute;lection.</span></p>
<p><img src="Tuto_Images/debut_pres9.gif" width="118" height="34" /> <span class="Contenu_Texte">La vue&nbsp;: vous permet d&rsquo;agrandir ou de r&eacute;tr&eacute;cir la vue de la carte. Dans   l&rsquo;ordre&nbsp;: vue a 100 p 100 &ndash; vue a 50 p 100 &ndash; vue a 25 p 100.</span></p>
<p align="justify"><img src="Tuto_Images/debut_pres10.gif" width="29" height="35" /> <span class="Contenu_Texte">La base de donn&eacute;es</span></p>
<p align="justify"><img src="Tuto_Images/debut_pres11.gif" width="29" height="33" /> <span class="Contenu_Texte">Le gestionnaire des ressources&nbsp;: permet d&rsquo;ajouter ou de supprimer des ressources   et de les visionner.</span></p>
<p align="justify"><img src="Tuto_Images/debut_pres12.gif" width="26" height="31" /> <span class="Contenu_Texte">L&rsquo;&eacute;diteur de&nbsp; scripts&nbsp;: outil avanc&eacute;   permettant d&rsquo;utiliser des lignes de programmation pour modifier votre jeu (sera   &eacute;tudi&eacute; en d&eacute;tail plus tard).</span></p>
<p><img src="Tuto_Images/debut_pres13.gif" width="25" height="34" /> <span class="Contenu_Texte">Ecouter les musiques du jeu.</span></p>
<p><img src="Tuto_Images/debut_pres14.gif" width="25" height="34" /> <span class="Contenu_Texte">Tester votre jeu.</span></p>
<p class="Contenu_Titre3">2-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   Liste des maps&nbsp;: </p>
<p class="Contenu_Texte">Ici   sont list&eacute;es toutes les maps(cartes) pr&eacute;sentes dans votre jeux. Nous allons   &eacute;tudier les maps en d&eacute;tail lors du 3eme tutorial de cette section. </p>
<p class="Contenu_Titre3">3-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   Les d&eacute;cors utilisables par la   map&nbsp;:</p>
<p class="Contenu_Texte">La   liste des d&eacute;cors qui peuvent &ecirc;tre utilis&eacute;s dans cette map.</p>
<p class="Contenu_Titre3">4-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   La map&nbsp;:</p>
<p class="Contenu_Texte">C&rsquo;est la que vous pouvez   editer votre carte .</p>
<p class="Bas_Remarque">Voila, le premier tutorial de cette section est termin&eacute;,   vous connaissez les bases&nbsp; du logiciel.   Maintenant nous allons passer au tutorial suivant qui traitera de la base de   donn&eacute;es qui est un des &eacute;l&eacute;ments les plus importants.</p>


